// Exercise 1
// Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

console.log("Exercise 1");

let a = +prompt("Введіть число а");
let b = +prompt("Введіть число b");
if (a > b) {
    console.log(`Число ${a} є більшим`);
} else if (a < b) {
    console.log(`Число ${b} є більшим`);
} else if (a === b) {
    console.log(`Число ${a} і ${b} є одинаковим`);
} else {
    console.log("Ви ввели не число");
}

console.log("______________");

// Exercise 2
// У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

console.log("Exercise 2");

let flat = Math.floor(+prompt("Ввеіть номер квартири"));
if (flat > 0 && flat < 21) {
    console.log(`Квартира ${flat} знаходиться у першому підїзді`)
} else if (flat > 20 && flat < 49) {
    console.log(`Квартира ${flat} знаходиться у другому підїзді`)
} else if (flat > 48 && flat < 91) {
    console.log(`Квартира ${flat} знаходиться у третьому підїзді`)
} else {
    console.log("Ви ввели некоректний номер квартири")
}

console.log("______________");

// Exercise 3
// Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

console.log("Exercise 3");

let number = +prompt("Введіть число");
if (number === 10) {
    console.log("Вірно");
} else {
    console.log("Невірно");
}

console.log("______________");

// Exercise 4
// Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести
// повідомлення що ми йдемо ВЧИТИСЯ. Якщо інша темпаретура, тоді виводимо повідомлення
// що сидимо вдома і вчимося ОНЛАЙН

console.log("Exercise 4");

let temp = +prompt("Введіть будь-ласка температуру");

if (temp >= 10 && temp <= 22) {
    console.log("Йдемо на навчання в OKTEN");
} else  {
    console.log("Сидимо вдома і вчимось ОНЛАЙН");
}

console.log("______________");

// Exercise 5
// За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
// І взалежності від введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо
// число не підходить тоді вивести Повідомлення - що число не вірне ... .

console.log("Exercise 5");

let winNumber = +prompt("Введіть число від 1 до 5");
switch (winNumber) {
    case 1 :
        console.log("Ви виграли Авто");
        break;
    case 2 :
        console.log("Ви виграли Мото");
        break;
    case 3 :
        console.log("Ви виграли Телефон");
        break;
    case 4 :
        console.log("Ви виграли Навушники");
        break;
    case 5 :
        console.log("Ви виграли 100грн");
        break;
    default :
        console.log("Число не вірне");
}

console.log("______________");