// Exercise 1
// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// Потрібно зробити перевірку якщо кількість елементів у масиві більше або дорівнює 3,
// то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

console.log("Exercise 1");

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    console.log("Це э великий масив, в якому  3 і більше елементи.");
}  else {
    console.log("Це э маленький масив, в якому менше 3-х елементів.");
}

console.log("______________");

// Exercise 2
// Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// Знайти, яке з них є середнім (більше одного, але менше за інше).
// Перевірити, чи знаходиться перше число між двома іншими.

console.log("Exercise 2");

let a = +prompt("Введіть число а");
let b = +prompt("Введіть число b");
let c = +prompt("Введіть число c");
if (a > b && a > c) {
    if (b > c) {
        console.log(`Число ${b} э середнім між ${a} ${c}`);
    } else {
        console.log(`Число ${c} э середнім між ${a} ${b}`);
    }
} else if (b > a && b > c) {
    if (a > c) {
        console.log(`Число ${a} э середнім між ${b} ${c}`);
    } else {
        console.log(`Число ${c} э середнім між ${b} ${a}`);
    }
} else if (c > a && c > b) {
    if (a > b) {
        console.log(`Число ${a} э середнім між ${c} ${b}`);
    } else {
        console.log(`Число ${b} э середнім між ${c} ${a}`);
    }
} else {
    console.log("Ви ввели некоректні числа");
}

console.log("______________");

// Exercise 3
// Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }

let result = ( a + b < 4) ? "Мало" : "Багато";

// Exercise 4
// Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним,
// негативним або нулем напишіть це тернарним оператором

// console.log("Exercise 4");

let number1 = (-59 >= -100) ? ("Число є негативним") :  ("Ви ввели некоректне число");
console.log(number1);
let number2 = (0 === 0) ? ("Число є нулем") :  ("Ви ввели некоректне число");
console.log(number2);
let number3 = (22 <= 100) ? ("Число є позитивне") :  ("Ви ввели некоректне число");
console.log(number3);

// let number = +prompt("Введіть число від -100 до 100");
// if (number >= -100 && number <= 100) {
//     if (number >= -100 && number < 0) {
//         console.log("Число є негативним");
//     } else if (number === 0) {
//         console.log("Чило є нулем");
//     } else {
//         console.log("Чило є позитивне");
//     }
// } else {
//     console.log("Ви ввели некоректне число");
// }

// console.log("______________");
